#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.cognito_pre_signup_log_group: Refreshing state... [id=/aws/lambda/cognito_pre_signup]
aws_cloudwatch_log_group.cognito_create_auth_challenge_log_group: Refreshing state... [id=/aws/lambda/cognito_create_auth_challenge]
aws_s3_bucket.cognito_passwordless_signin_lambda_deploys: Refreshing state... [id=cognito-passwordless-signin-lambda-deploys]
aws_cloudwatch_log_group.cognito_verify_auth_challenge_log_group: Refreshing state... [id=/aws/lambda/cognito_verify_auth_challenge]
aws_cloudwatch_log_group.cognito_define_auth_challenge_log_group: Refreshing state... [id=/aws/lambda/cognito_define_auth_challenge]
aws_ses_email_identity.ses_email_identity: Refreshing state... [id=brunotj2015@hotmail.com]
aws_cognito_user_pool.cognito_user_pool: Refreshing state... [id=sa-east-1_af5EaSTDN]
aws_iam_role.cognito_create_auth_challenge_role: Refreshing state... [id=cognito_create_auth_challenge_role]
aws_iam_role.cognito_verify_auth_challenge_role: Refreshing state... [id=cognito_verify_auth_challenge_role]
aws_iam_role.cognito_pre_signup_role: Refreshing state... [id=cognito_pre_signup_role]
aws_iam_role.cognito_define_auth_challenge_role: Refreshing state... [id=cognito_define_auth_challenge_role]
aws_s3_bucket_public_access_block.cognito_passwordless_signin_lambda_deploys_public_access_block: Refreshing state... [id=cognito-passwordless-signin-lambda-deploys]
aws_s3_bucket_versioning.cognito_passwordless_signin_lambda_deploys_versioning: Refreshing state... [id=cognito-passwordless-signin-lambda-deploys]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_role.cognito_create_auth_challenge_role has changed
  ~ resource "aws_iam_role" "cognito_create_auth_challenge_role" {
        id                    = "cognito_create_auth_challenge_role"
        name                  = "cognito_create_auth_challenge_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {}
      - inline_policy {
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_create_auth_challenge:*"
                        },
                      - {
                          - Action    = [
                              - "s3:GetObject",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - s3:ResourceAccount = "357732810582"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::cognito-passwordless-signin-lambda-deploys/cognito_verify_auth_challenge"
                        },
                      - {
                          - Action   = [
                              - "ses:SendEmail",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ses:sa-east-1:357732810582:identity/brunotj2015@hotmail.com"
                        },
                      - {
                          - Action    = "lambda:InvokeFunction"
                          - Condition = {
                              - ArnLike = {
                                  - AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          - Effect    = "Allow"
                          - Principal = {
                              - Service = "cognito-idp.amazonaws.com"
                            }
                          - Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.cognito_define_auth_challenge_role has changed
  ~ resource "aws_iam_role" "cognito_define_auth_challenge_role" {
        id                    = "cognito_define_auth_challenge_role"
        name                  = "cognito_define_auth_challenge_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {}
      - inline_policy {
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_define_auth_challenge:*"
                        },
                      - {
                          - Action    = [
                              - "s3:GetObject",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - s3:ResourceAccount = "357732810582"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::cognito-passwordless-signin-lambda-deploys/cognito_verify_auth_challenge"
                        },
                      - {
                          - Action    = "lambda:InvokeFunction"
                          - Condition = {
                              - ArnLike = {
                                  - AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          - Effect    = "Allow"
                          - Principal = {
                              - Service = "cognito-idp.amazonaws.com"
                            }
                          - Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.cognito_pre_signup_role has changed
  ~ resource "aws_iam_role" "cognito_pre_signup_role" {
        id                    = "cognito_pre_signup_role"
        name                  = "cognito_pre_signup_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {}
      - inline_policy {
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_pre_signup:*"
                        },
                      - {
                          - Action    = [
                              - "s3:GetObject",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - s3:ResourceAccount = "357732810582"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::cognito-passwordless-signin-lambda-deploys/cognito_verify_auth_challenge"
                        },
                      - {
                          - Action    = "lambda:InvokeFunction"
                          - Condition = {
                              - ArnLike = {
                                  - AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          - Effect    = "Allow"
                          - Principal = {
                              - Service = "cognito-idp.amazonaws.com"
                            }
                          - Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.cognito_verify_auth_challenge_role has changed
  ~ resource "aws_iam_role" "cognito_verify_auth_challenge_role" {
        id                    = "cognito_verify_auth_challenge_role"
        name                  = "cognito_verify_auth_challenge_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {}
      - inline_policy {
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_verify_auth_challenge:*"
                        },
                      - {
                          - Action    = [
                              - "s3:GetObject",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - s3:ResourceAccount = "357732810582"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::cognito-passwordless-signin-lambda-deploys/cognito_verify_auth_challenge"
                        },
                      - {
                          - Action    = "lambda:InvokeFunction"
                          - Condition = {
                              - ArnLike = {
                                  - AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          - Effect    = "Allow"
                          - Principal = {
                              - Service = "cognito-idp.amazonaws.com"
                            }
                          - Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.cognito_create_auth_challenge_role will be updated in-place
  ~ resource "aws_iam_role" "cognito_create_auth_challenge_role" {
        id                    = "cognito_create_auth_challenge_role"
        name                  = "cognito_create_auth_challenge_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      + {
                          + Action   = [
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_create_auth_challenge:*"
                        },
                      + {
                          + Action   = [
                              + "ses:SendEmail",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:ses:sa-east-1:357732810582:identity/brunotj2015@hotmail.com"
                        },
                      + {
                          + Action    = "lambda:InvokeFunction"
                          + Condition = {
                              + ArnLike = {
                                  + AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          + Effect    = "Allow"
                          + Principal = {
                              + Service = "cognito-idp.amazonaws.com"
                            }
                          + Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {}
    }

  # aws_iam_role.cognito_define_auth_challenge_role will be updated in-place
  ~ resource "aws_iam_role" "cognito_define_auth_challenge_role" {
        id                    = "cognito_define_auth_challenge_role"
        name                  = "cognito_define_auth_challenge_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      + {
                          + Action   = [
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_define_auth_challenge:*"
                        },
                      + {
                          + Action    = "lambda:InvokeFunction"
                          + Condition = {
                              + ArnLike = {
                                  + AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          + Effect    = "Allow"
                          + Principal = {
                              + Service = "cognito-idp.amazonaws.com"
                            }
                          + Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {}
    }

  # aws_iam_role.cognito_pre_signup_role will be updated in-place
  ~ resource "aws_iam_role" "cognito_pre_signup_role" {
        id                    = "cognito_pre_signup_role"
        name                  = "cognito_pre_signup_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      + {
                          + Action   = [
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_pre_signup:*"
                        },
                      + {
                          + Action    = "lambda:InvokeFunction"
                          + Condition = {
                              + ArnLike = {
                                  + AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          + Effect    = "Allow"
                          + Principal = {
                              + Service = "cognito-idp.amazonaws.com"
                            }
                          + Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {}
    }

  # aws_iam_role.cognito_verify_auth_challenge_role will be updated in-place
  ~ resource "aws_iam_role" "cognito_verify_auth_challenge_role" {
        id                    = "cognito_verify_auth_challenge_role"
        name                  = "cognito_verify_auth_challenge_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:*"
                        },
                      + {
                          + Action   = [
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:sa-east-1:357732810582:log-group:/aws/lambda/cognito_verify_auth_challenge:*"
                        },
                      + {
                          + Action    = "lambda:InvokeFunction"
                          + Condition = {
                              + ArnLike = {
                                  + AWS:SourceArn = "arn:aws:cognito-idp:sa-east-1:357732810582:userpool/sa-east-1_af5EaSTDN"
                                }
                            }
                          + Effect    = "Allow"
                          + Principal = {
                              + Service = "cognito-idp.amazonaws.com"
                            }
                          + Resource  = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {}
    }

  # aws_lambda_function.cognito_create_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_create_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_create_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::357732810582:role/cognito_create_auth_challenge_role"
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_define_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_define_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_define_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::357732810582:role/cognito_define_auth_challenge_role"
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_pre_signup will be created
  + resource "aws_lambda_function" "cognito_pre_signup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_pre_signup"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::357732810582:role/cognito_pre_signup_role"
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_verify_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_verify_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_verify_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::357732810582:role/cognito_verify_auth_challenge_role"
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 4 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @PoorlyDefinedBehaviour, Action: `pull_request`*